Revit 2027 API
IFCCategoryTemplate.UpdateCategoryList Method
 Updates the mapping table with the categories from the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void UpdateCategoryList(
	Document document
)
Public Sub UpdateCategoryList (
	document As Document
)
public:
void UpdateCategoryList(
	Document^ document
)
member UpdateCategoryList :
        document : Document -> unit
Parameters
document Document
 A Revit document to retrieve names from.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCCategoryTemplate Class
Autodesk.Revit.DB Namespace